## Target env: env/managed_grafana
### Terraform Init `success`
### Terraform Validate `success`
### Terraform Plan `success`

<details><summary>Show Plan</summary>

```terraform
data.aws_caller_identity.current: Reading...
data.aws_ssoadmin_instances.example: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=686355260515]
data.aws_ssoadmin_instances.example: Read complete after 0s [id=ap-northeast-1]
data.aws_identitystore_user.naruse: Reading...
data.aws_identitystore_user.naruse: Read complete after 1s [id=e7d4ca38-6091-7096-1302-78b27ac5b527]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_grafana_role_association.example will be created
  + resource "aws_grafana_role_association" "example" {
      + id           = (known after apply)
      + role         = "ADMIN"
      + user_ids     = [
          + "e7d4ca38-6091-7096-1302-78b27ac5b527",
        ]
      + workspace_id = (known after apply)
    }

  # aws_grafana_workspace.example will be created
  + resource "aws_grafana_workspace" "example" {
      + account_access_type       = "CURRENT_ACCOUNT"
      + arn                       = (known after apply)
      + authentication_providers  = [
          + "AWS_SSO",
        ]
      + configuration             = (known after apply)
      + endpoint                  = (known after apply)
      + grafana_version           = (known after apply)
      + id                        = (known after apply)
      + name                      = "managed_grafana"
      + permission_type           = "SERVICE_MANAGED"
      + role_arn                  = (known after apply)
      + saml_configuration_status = (known after apply)
      + tags_all                  = (known after apply)
    }

  # aws_identitystore_group.example will be created
  + resource "aws_identitystore_group" "example" {
      + description       = "test managed grafana"
      + display_name      = "GrafanaSSOGroup"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-95677f14e5"
    }

  # aws_ssoadmin_account_assignment.example will be created
  + resource "aws_ssoadmin_account_assignment" "example" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-7758723022a432a5"
      + permission_set_arn = (known after apply)
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "686355260515"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_managed_policy_attachment.example will be created
  + resource "aws_ssoadmin_managed_policy_attachment" "example" {
      + id                  = (known after apply)
      + instance_arn        = "arn:aws:sso:::instance/ssoins-7758723022a432a5"
      + managed_policy_arn  = "arn:aws:iam::aws:policy/AWSGrafanaAccountAdministrator"
      + managed_policy_name = (known after apply)
      + permission_set_arn  = (known after apply)
    }

  # aws_ssoadmin_permission_set.example will be created
  + resource "aws_ssoadmin_permission_set" "example" {
      + arn              = (known after apply)
      + created_date     = (known after apply)
      + description      = "test managed grafana SSO"
      + id               = (known after apply)
      + instance_arn     = "arn:aws:sso:::instance/ssoins-7758723022a432a5"
      + name             = "GrafanaSSO"
      + session_duration = "PT2H"
      + tags_all         = (known after apply)
    }

  # module.grafana_role.aws_iam_role.role will be created
  + resource "aws_iam_role" "role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "grafana.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "grafana-assume-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>